nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/low_level/cc13xx/mac_radio.c
/******************************************************************************

 @file  mac_radio.c

 @brief Describe the purpose and contents of the file.

 Group: WCS, LPC
 Target Device: cc13xx_cc26xx

 ******************************************************************************
 
 Copyright (c) 2006-2021, Texas Instruments Incorporated
 All rights reserved.

 IMPORTANT: Your use of this Software is limited to those specific rights
 granted under the terms of a software license agreement between the user
 who downloaded the software, his/her employer (which must be your employer)
 and Texas Instruments Incorporated (the "License"). You may not use this
 Software unless you agree to abide by the terms of the License. The License
 limits your use, and you acknowledge, that the Software may not be modified,
 copied or distributed unless embedded on a Texas Instruments microcontroller
 or used solely and exclusively in conjunction with a Texas Instruments radio
 frequency transceiver, which is integrated into your product. Other than for
 the foregoing purpose, you may not use, reproduce, copy, prepare derivative
 works of, modify, distribute, perform, display or sell this Software and/or
 its documentation for any purpose.

 YOU FURTHER ACKNOWLEDGE AND AGREE THAT THE SOFTWARE AND DOCUMENTATION ARE
 PROVIDED "AS IS" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESS OR IMPLIED,
 INCLUDING WITHOUT LIMITATION, ANY WARRANTY OF MERCHANTABILITY, TITLE,
 NON-INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT SHALL
 TEXAS INSTRUMENTS OR ITS LICENSORS BE LIABLE OR OBLIGATED UNDER CONTRACT,
 NEGLIGENCE, STRICT LIABILITY, CONTRIBUTION, BREACH OF WARRANTY, OR OTHER
 LEGAL EQUITABLE THEORY ANY DIRECT OR INDIRECT DAMAGES OR EXPENSES
 INCLUDING BUT NOT LIMITED TO ANY INCIDENTAL, SPECIAL, INDIRECT, PUNITIVE
 OR CONSEQUENTIAL DAMAGES, LOST PROFITS OR LOST DATA, COST OF PROCUREMENT
 OF SUBSTITUTE GOODS, TECHNOLOGY, SERVICES, OR ANY CLAIMS BY THIRD PARTIES
 (INCLUDING BUT NOT LIMITED TO ANY DEFENSE THEREOF), OR OTHER SIMILAR COSTS.

 Should you have any questions regarding your right to use this Software,
 contact Texas Instruments Incorporated at www.TI.com.

 ******************************************************************************
 
 
 *****************************************************************************/

/* ------------------------------------------------------------------------------------------------
 *                                          Includes
 * ------------------------------------------------------------------------------------------------
 */

#ifndef LIBRARY
#include "ti_wisunfan_features.h"
#endif

/* hal */
#include "hal_types.h"

/* high-level */
#include "mac_pib.h"
#include "mac_main.h"
#include "mac_mgmt.h"
#include "mac_hl_patch.h"

/* exported low-level */
#include "mac_low_level.h"

/* radio specific */
#include <hw_rfc_dbell.h>
#include "rf_mac_api.h"

/* low-level specific */
#include "mac_radio.h"
#include "mac_tx.h"
#include "mac_rx.h"
#include "mac_rx_onoff.h"
#include "mac.h"
#include "mac_settings.h"

/* target specific */
#include "mac_radio_defs.h"
#include "mac_symbol_timer.h"
#include "mac_user_config.h"

/* Chip specific */
#include <hw_memmap.h>
#include <hw_fcfg1.h>
#include <chipinfo.h>

/* Activity Tracking */
#include "mac_activity.h"

/* debug */
#include "mac_assert.h"

// SW Tracer
#include "dbg.h"
#ifdef DEBUG_SW_TRACE
#define DBG_ENABLE
#ifndef _DBGFILE
#define _DBGFILE mac_radio_c
#endif
#include "dbgid_sys_mst.h"
#endif // DEBUG_SW_TRACE

#include "rom_jt_154.h"

/* ------------------------------------------------------------------------------------------------
 *                                         Defines
 * ------------------------------------------------------------------------------------------------
 */
#define ED_RF_POWER_MIN_DBM   (MAC_RADIO_RECEIVER_SENSITIVITY_DBM + MAC_SPEC_ED_MIN_DBM_ABOVE_RECEIVER_SENSITIVITY)
#define ED_RF_POWER_MAX_DBM   MAC_RADIO_RECEIVER_SATURATION_DBM

/* register value table offset */
#define MAC_RADIO_DEFS_TBL_TXPWR_FIRST_ENTRY   0
#define MAC_RADIO_DEFS_TBL_TXPWR_LAST_ENTRY    1
#define MAC_RADIO_DEFS_TBL_TXPWR_ENTRIES       2

/* 433 MHz Override and Power table offset */
#define MAC_FREQ_OVRRIDE_TBL_OFFSET_433      3
#define MAC_FREQ_PWR_TBL_OFFSET_433  1

/* Dynamic PA Override table offset */
#define MAC_DYNAMIC_PA_STD_TBL_OFFSET  1
#define MAC_DYNAMIC_PA_TX20_TBL_OFFSET 2

/* Chip user ID */
#define MAC_RADIO_CC1350_MULTI_PROTOCOL_7X7    0x2002F000
#define MAC_RADIO_CC1350_MULTI_PROTOCOL_5x5    0x2001F000
#define MAC_RADIO_CC1350_MULTI_PROTOCOL_4x4    0x2000F000
#define MAC_RADIO_CC1310_PROPRIETARY_7X7       0x20028000
#define MAC_RADIO_CC1310_PROPRIETARY_5x5       0x20018000
#define MAC_RADIO_CC1310_PROPRIETARY_4x4       0x20008000

#define MAC_RADIO_CC1352_MULTI_PROTOCOL_7X7    0x0082F000
#define MAC_RADIO_CC1352_PG1_1_MULTI_PROTOCOL_7X7    0x2082F000
#define MAC_RADIO_CC1312_PG1_1_MULTI_PROTOCOL_7X7    0x20828000
/* ------------------------------------------------------------------------------------------------
 *                                        Global Variables
 * ------------------------------------------------------------------------------------------------
 */
uint32 macPhyTxPower;
/**
    Activity Tracking Object.
    Holds the function pointers related
    to Activity tracking module.
*/
 __attribute__((weak)) const activityObject_t activityObject = {
    .pSetActivityTrackingTxFn = NULL,
    .pSetActivityTrackingRxFn = NULL,
    .pGetActivityPriorityTxFn = NULL,
    .pGetActivityPriorityRxFn = NULL,
    .pSetActivityTxFn = NULL,
    .pSetActivityRxFn = NULL,
    .pGetActivityTxFn = NULL,
    .pGetActivityRxFn = NULL,
  #ifdef MAC_ACTIVITY_PROFILING
    .pStartActivityProfilingTimerFn = NULL,
    .pPrintActivityInfoFn = NULL
  #endif
};

/* ------------------------------------------------------------------------------------------------
 *                                        Local Variables
 * ------------------------------------------------------------------------------------------------
 */
static uint8 reqChannel;
static uint32 reqTxPower;
static uint16 macSavedPanID;

RF_Mode *pRfMode;
RF_TxPowerTable_Entry *pRfPowerTable;
macRfCfg_maxPower_t *pMaxPower;

#if defined(COMBO_MAC) || !defined(FREQ_2_4G)
static uint8 phyIdOld = 0xFF;
#endif
/* RF Object for TIMAC */
static volatile RF_Object RF_object;


