nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/low_level/cc13xx/mac_radio.c
/* RF handle for TIMAC */
RF_Handle RF_handle = NULL;

/* RF Parameters for TIMAC */
RF_Params RF_params;

/* ------------------------------------------------------------------------------------------------
 *                                        Local Functions
 * ------------------------------------------------------------------------------------------------
 */
static void macRadioSelectConfig(void);
#if defined(COMBO_MAC) || !defined(FREQ_2_4G)
static bool  macRadioIdCheckOk(void);

/**************************************************************************************************
 * @fn          macRadioIdCheckOk
 *
 * @brief       Radio ID check.
 *
 * @param       none
 *
 * @return      TRUE if chip ID is okay to run TIMAC2.0
 *              FALSE otherwise
 **************************************************************************************************
 */
static bool macRadioIdCheckOk(void)
{
#ifndef TIMAC_AGAMA_FPGA
  if (ChipInfo_GetChipType() == CHIP_TYPE_CC1310 ||
      ChipInfo_GetChipType() == CHIP_TYPE_CC1350 ||
      ChipInfo_GetChipType() == CHIP_TYPE_CC2650 ||
      ChipInfo_GetChipType() == CHIP_TYPE_CC1312 ||
      ChipInfo_GetChipType() == CHIP_TYPE_CC1352 ||
      ChipInfo_GetChipType() == CHIP_TYPE_CC2652 ||
      ChipInfo_GetChipType() == CHIP_TYPE_CC1352P ||
      ChipInfo_GetChipType() == CHIP_TYPE_CC1312R7 ||
      ChipInfo_GetChipType() == CHIP_TYPE_CC1352R7 ||
      ChipInfo_GetChipType() == CHIP_TYPE_CC1352P7)
  {
    return TRUE;
  }
  else
  {
    return FALSE;
  }
#else
  return TRUE;
#endif
}
#endif

/**************************************************************************************************
 * @fn          macGetRadioState
 *
 * @brief       Returns Radio State.
 *
 * @param       none
 *
 * @return      TRUE if Radio is ON
 *              FALSE otherwise
 **************************************************************************************************
 */
bool macGetRadioState(void)
{
  RF_InfoVal info;

  RF_getInfo(RF_handle, RF_GET_RADIO_STATE, &info);
  return (info.bRadioState);
}
/**************************************************************************************************
 * @fn          macRadioSelectConfig
 *
 * @brief       Radio config selection.
 *
 * @param       none
 *
 * @return      none
 **************************************************************************************************
 */
static void macRadioSelectConfig(void)
{
    if(pMacRadioConfig->pRfSelectFP)
    {
        pMacRadioConfig->pRfSelectFP(pMacPib->curPhyID);
    }
}

#if defined(COMBO_MAC) || !defined(FREQ_2_4G)
/**************************************************************************************************
 * @fn          macRadioInitSubG
 *
 * @brief       (Re-)Initialize radio hardware.
 *
 * @param       none
 *
 * @return      none
 **************************************************************************************************
 */
MAC_INTERNAL_API void macRadioInitSubG(void)
{
  macMRFSKPHYDesc_t *pPhyDesc;
  uint32 txPower;

  RF_ScheduleCmdParams RF_schParams;
  RF_ScheduleCmdParams_init(&RF_schParams);
  RF_schParams.endTime = 0;

  /* Acquire Activity priority */
  if (activityObject.pGetActivityPriorityTxFn)
  {
      RF_schParams.activityInfo = activityObject.pGetActivityPriorityTxFn();
  }

  if (RF_handle == NULL)
  {
    MAC_ASSERT(macRadioIdCheckOk());

    /* RF driver function table should be prepared */
    MAC_ASSERT(macRfDrvTblPtr != NULL);

    /* Initialize RF Driver parameters */
    RF_Params_init(&RF_params);
	RF_params.nID = RF_STACK_ID_154;
  }

  macRadioSelectConfig();

  pPhyDesc = MAP_macMRFSKGetPhyDesc(pMacPib->curPhyID);

  txPower = macGetRadioTxPowerReg(pMacPib->phyTransmitPower);
  if (txPower != MAC_RADIO_TX_POWER_INVALID)
  {
    RF_TxPowerTable_Value value = *(RF_TxPowerTable_Value *)&txPower;
    if (value.paType == RF_TxPowerTable_DefaultPA)
    {
        RF_cmdPropRadioDivSetup.txPower = (uint16)value.rawValue;
    }
    else
    {
        RF_cmdPropRadioDivSetup.txPower = (uint16)0xFFFF;
    }
  }

  RF_cmdPropRadioDivSetup.centerFreq = (pPhyDesc->firstChCentrFreq +
    ((pPhyDesc->noOfChannels - 1) * pPhyDesc->channelSpacing) / 2) / 1000;

  RF_cmdPropRadioDivSetup.status = IDLE;
  RF_cmdPropRadioDivSetup.pNextOp = NULL;
  RF_cmdPropRadioDivSetup.condition.rule = COND_NEVER;
  RF_cmdPropRadioDivSetup.startTrigger.pastTrig = 1;

  // apply pib value for fskPreambleLen to set the actual RF_cmdPropRadioDivSetup setting
  RF_cmdPropRadioDivSetup.preamConf.nPreamBytes = pMacPib->fskPreambleLen;

  /* don't change the below variables if csm is in operation */
  if ( FALSE == MAP_macIsCsmOperational() )
  {
    /* Use the correct symbol timing per PIB configuration */
    macSpecUsecsPerSymbol = 1000 / pPhyDesc->symbolRate;

    /* Use the symbol timing per macUnitBackoffPeriod */
    macUnitBackoffPeriod = 1000 / macSpecUsecsPerSymbol;
  }


  if (RF_handle == NULL)
  {
    /* Request access to the radio */
    RF_handle = RF_open((RF_Object *)&RF_object, pRfMode, (RF_RadioSetup*) &RF_cmdPropRadioDivSetup, &RF_params);

#ifdef MAC_ACTIVITY_PROFILING
    /* Successful transmission, reset tracking data */
    if (activityObject.pStartActivityProfilingTimerFn)
    {
        activityObject.pStartActivityProfilingTimerFn(RF_handle);
    }
#endif
  }
  else
  {
    macStopCmd(FALSE);

    if (pMacPib->curPhyID == phyIdOld)
    {
      RF_scheduleCmd(RF_handle, (RF_Op*) &RF_cmdPropRadioDivSetup, &RF_schParams,
                     NULL, RF_EventLastCmdDone);
      lastPostCmd = (uint32_t*)&RF_cmdPropRadioDivSetup;
    }
    else
    {
      /* RF_ratDisableChannel is needed ? */
      RF_close(RF_handle);
      macRadioYielded = MAC_RADIO_YIELDED;
      RF_handle = RF_open((RF_Object *)&RF_object, pRfMode, (RF_RadioSetup*) &RF_cmdPropRadioDivSetup, &RF_params);

#ifdef MAC_ACTIVITY_PROFILING
      /* Successful transmission, reset tracking data */
      if (activityObject.pStartActivityProfilingTimerFn)
      {
          activityObject.pStartActivityProfilingTimerFn(RF_handle);
      }
#endif
    }
  }
  phyIdOld = pMacPib->curPhyID;
}
#endif
/**************************************************************************************************
 * @fn          macRadioInit
 *
 * @brief       (Re-)Initialize radio hardware.
 *
 * @param       none
 *
 * @return      none
 **************************************************************************************************
 */
MAC_INTERNAL_API void macRadioInit(void)
{
    SELECT_CALL(macRadioInit);
}

