nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/low_level/cc13xx/mac_radio.c
/**************************************************************************************************
 * @fn          macRadioSwInit
 *
 * @brief       Initialize radio software.
 *
 * @param       none
 *
 * @return      none
 **************************************************************************************************
 */
MAC_INTERNAL_API void macRadioSwInit(void)
{
  /* Variable initialization for this module */
  reqChannel    = MAC_RADIO_CHANNEL_DEFAULT;
  macPhyChannel = MAC_RADIO_CHANNEL_INVALID;
  reqTxPower    = MAC_RADIO_TX_POWER_INVALID;
  macPhyTxPower = MAC_RADIO_TX_POWER_INVALID;
}


/**************************************************************************************************
 * @fn          macRadioReset
 *
 * @brief       Resets the radio module.
 *
 * @param       none
 *
 * @return      none
 **************************************************************************************************
 */
MAC_INTERNAL_API void macRadioReset(void)
{
}

/**************************************************************************************************
 * @fn          macRadioSetRE
 *
 * @brief       Set Range Extender.
 *
 * @param       hgm - high gain mode (0 : off, 1 : high gain, 2 : low gain)
 *
 * @return      none
 **************************************************************************************************
 */
MAC_INTERNAL_API void macRadioSetRE(uint32 hgm)
{
    // This function is not used anymore in Agama.
}

/**************************************************************************************************
 * @fn          macRadioRandomByte
 *
 * @brief       Return a random byte derived from previously set random seed.
 *
 * @param       none
 *
 * @return      a random byte
 **************************************************************************************************
 */
MAC_INTERNAL_API uint8 macRadioRandomByte(void)
{
  return(MAC_RADIO_RANDOM_BYTE());
}


/**************************************************************************************************
 * @fn          macRadioSetPanCoordinator
 *
 * @brief       Configure the pan coordinator status of the radio
 *
 * @param       panCoordFlag - non-zero to configure radio to be pan coordinator
 *                             zero to configure radio as NON pan coordinator
 *
 * @return      none
 **************************************************************************************************
 */
MAC_INTERNAL_API void macRadioSetPanCoordinator(uint8 panCoordFlag)
{
  /* abstracted radio configuration */
  MAC_RADIO_SET_PAN_COORDINATOR(panCoordFlag);
}


/**************************************************************************************************
 * @fn          macRadioSetPanID
 *
 * @brief       Set the pan ID on the radio.
 *
 * @param       panID - 16 bit PAN identifier
 *
 * @return      none
 **************************************************************************************************
 */
void macRadioSetPanID(uint16 panID)
{
  /* abstracted radio configuration */
  MAC_RADIO_SET_PAN_ID(panID);
}


/**************************************************************************************************
 * @fn          macRadioSetShortAddr
 *
 * @brief       Set the short address on the radio.
 *
 * @param       shortAddr - 16 bit short address
 *
 * @return      none
 **************************************************************************************************
 */
MAC_INTERNAL_API void macRadioSetShortAddr(uint16 shortAddr)
{
  /* abstracted radio configuration */
  MAC_RADIO_SET_SHORT_ADDR(shortAddr);
}


/**************************************************************************************************
 * @fn          macRadioSetIEEEAddr
 *
 * @brief       Set the IEEE address on the radio.
 *
 * @param       pIEEEAddr - pointer to array holding 64 bit IEEE address; array must be little
 *                          endian format (starts with lowest signficant byte)
 *
 * @return      none
 **************************************************************************************************
 */
MAC_INTERNAL_API void macRadioSetIEEEAddr(uint8 * pIEEEAddr)
{
  /* abstracted radio configuration */
  MAC_RADIO_SET_EXT_ADDR(pIEEEAddr);
}


/**************************************************************************************************
 * @fn          macRadioSetTxPower
 *
 * @brief       Set transmitter power of the radio.
 *
 * @param       txPower - TX power in dBm
 *
 * @return      none
 **************************************************************************************************
 */
MAC_INTERNAL_API uint8 macRadioSetTxPower(int8 txPower)
{
  if (macGetRadioTxPowerReg(txPower) == MAC_RADIO_TX_POWER_INVALID)
  {
    return MAC_INVALID_PARAMETER;
  }

  /* update the radio power setting */
  macRadioUpdateTxPower();

  return MAC_SUCCESS;
}

/**************************************************************************************************
 * @fn          macRadioNeedAdjustPower
 *
 * @brief       Decide whether power adjustment is needed or not.
 *
 * @param       reqCh - new channel
 *              oldCh - old channel
 *
 * @return      TRUE if adjustment is needed
 *              FALSE otherwise
 **************************************************************************************************
 */
MAC_INTERNAL_API bool macRadioNeedAdjustPower(uint8_t reqCh, uint8_t oldCh)
{
    if(pMaxPower)
    {
        uint8_t reqChIdx;
        uint8_t oldChIdx;

        reqChIdx = reqCh - pMaxPower->first;
        oldChIdx = oldCh - pMaxPower->first;
        if((oldCh == MAC_RADIO_CHANNEL_INVALID)
        || ((oldCh < pMaxPower->first) || (oldCh >= pMaxPower->first + pMaxPower->numbers))
        || (pMaxPower->pTable[reqChIdx] != pMaxPower->pTable[oldChIdx]))
        {
            return(TRUE);
        }
    }
    return(FALSE);
}

/**************************************************************************************************
 * @fn          macRadioLimitTxPower
 *
 * @brief       Limit tx power
 *
 * @param       reqCh - current channel
 *              pTxPower - pointer of power value
 *
 * @return      none
 *
 **************************************************************************************************
 */
MAC_INTERNAL_API void macRadioLimitTxPower(uint8_t reqCh, int8_t *pTxPower)
{
    if(pMaxPower)
    {
        uint8_t reqChIdx;
        int8_t txPower = *pTxPower;

