nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/low_level/cc13xx/mac_radio.c
        if((reqCh >= pMaxPower->first) && (reqCh < pMaxPower->first + pMaxPower->numbers))
        {
            reqChIdx = reqCh - pMaxPower->first;
            if(txPower > pMaxPower->pTable[reqChIdx])
            {
                txPower = pMaxPower->pTable[reqChIdx];
                *pTxPower = txPower;
            }
        }
    }
}

/**************************************************************************************************
 * @fn          macGetRadioTxPowerReg
 *
 * @brief       Find transmitter power register value.
 *
 * @param       txPower - TX power in dBm.
 *
 * @return      TX Power register setting if found.
 *              0xFFFFFFFF if there is no register value that matches txPower
 **************************************************************************************************
 */
MAC_INTERNAL_API uint32 macGetRadioTxPowerReg(int8 txPower)
{
  RF_TxPowerTable_Entry *pTxPwrTbl;
  RF_TxPowerTable_Value value;

  macRadioLimitTxPower(macPhyChannel, &txPower);

  pTxPwrTbl = pRfPowerTable;

  value = RF_TxPowerTable_findValue(pTxPwrTbl, txPower);
  if (value.rawValue != RF_TxPowerTable_INVALID_VALUE)
  {
      reqTxPower = *(uint32 *)&value;
      return reqTxPower;
  }

  return MAC_RADIO_TX_POWER_INVALID;
}


/**************************************************************************************************
 * @fn          macRadioUpdateTxPower
 *
 * @brief       Update the radio's transmit power if a new power level has been requested
 *
 * @param       reqTxPower - file scope variable that holds the last request power level
 *              macPhyTxPower - global variable that holds radio's set power level
 *
 * @return      none
 **************************************************************************************************
 */
MAC_INTERNAL_API void macRadioUpdateTxPower(void)
{
  halIntState_t  s;

  /*
   *  If the requested power setting is different from the actual radio setting,
   *  attempt to udpate to the new power setting.
   */
  HAL_ENTER_CRITICAL_SECTION(s);
  if (reqTxPower != macPhyTxPower)
  {
    /*
     *  Radio power cannot be updated when the radio is physically transmitting.
     *  If there is a possibility radio is transmitting, do not change the power
     *  setting.  This function will be called again after the current transmit
     *  completes.
     */
    if (!macRxOutgoingAckFlag && !MAC_TX_IS_PHYSICALLY_ACTIVE())
    {

      /*
       *  Set new power level;  update the shadow value and write
       *  the new value to the radio hardware.
       */
      macPhyTxPower = reqTxPower;
      HAL_EXIT_CRITICAL_SECTION(s);

      macSetTxPowerVal(macPhyTxPower);

      return;
    }
  }
  HAL_EXIT_CRITICAL_SECTION(s);
}


/**************************************************************************************************
 * @fn          macRadioSetChannel
 *
 * @brief       Set radio channel.
 *
 * @param       channel - channel number, valid range is 11 through 26. Allow
 *              channels 27 and 28 for some Japanese customers.
 *
 * @return      TRUE if successful, FALSE otherwise
 **************************************************************************************************
 */
MAC_INTERNAL_API bool macRadioSetChannel(uint8 channel)
{
  halIntState_t  s;

  /* illegal channel */
#if (MAC_CHAN_LOWEST == 0)
  /* No need to check MAC_CHAN_LOWEST if it is zero */
  MAC_ASSERT(channel <= MAC_CHAN_HIGHEST);
#else
  MAC_ASSERT((channel >= MAC_CHAN_LOWEST) && (channel <= MAC_CHAN_HIGHEST));
#endif

  /* critical section to make sure transmit does not start while updating channel */
  HAL_ENTER_CRITICAL_SECTION(s);

  /* set requested channel */
  reqChannel = channel;

  /*
   *  If transmit is not active, update the radio hardware immediately.  If transmit is active,
   *  the channel will be updated at the end of the current transmit.
   */
    if (!(MAC_TX_IS_PHYSICALLY_ACTIVE()))
    {
      HAL_EXIT_CRITICAL_SECTION(s);
      return macRadioUpdateChannel();
    }

  HAL_EXIT_CRITICAL_SECTION(s);

  return TRUE;
}

MAC_INTERNAL_API bool macRadioSetChannelRx(uint8 channel)
{
  halIntState_t  s;

  /* illegal channel */
#if (MAC_CHAN_LOWEST == 0)
  /* No need to check MAC_CHAN_LOWEST if it is zero */
  MAC_ASSERT(channel <= MAC_CHAN_HIGHEST);
#else
  MAC_ASSERT((channel >= MAC_CHAN_LOWEST) && (channel <= MAC_CHAN_HIGHEST));
#endif

  /* critical section to make sure transmit does not start while updating channel */
  HAL_ENTER_CRITICAL_SECTION(s);

  /* set requested channel */
  reqChannel = channel;

  /*
   *  If transmit is not active, update the radio hardware immediately.  If transmit is active,
   *  the channel will be updated at the end of the current transmit.
   */
    if (!(MAC_TX_IS_PHYSICALLY_ACTIVE()))
    {
      HAL_EXIT_CRITICAL_SECTION(s);
      return macRadioUpdateChannelRx();
    }

  HAL_EXIT_CRITICAL_SECTION(s);

  return TRUE;
}
/**************************************************************************************************
 * @fn          macRadioUpdateChannel
 *
 * @brief       Update the radio channel if a new channel has been requested.
 *
 * @param       none
 *
 * @return      TRUE if successful, FALSE otherwise
 **************************************************************************************************
 */
MAC_INTERNAL_API bool macRadioUpdateChannel(void)
{
  halIntState_t  s;

  MAC_ASSERT(!(MAC_TX_IS_PHYSICALLY_ACTIVE()));
  /* if the channel has changed or a scanning is in process,
     set the radio to the new channel */
  HAL_ENTER_CRITICAL_SECTION(s);
  if ((reqChannel != macPhyChannel) ||
      (macRxEnableFlags & MAC_RX_SCAN))
  {
    /* Changing the channel stops any receive in progress.
     * Also note that this RX off and on sequence must be
     * executed for the coordinator since the radio may be
     * waiting for the prior RX on a different channel.
     * If the sequence is not executed, the radio will remain
     * stuck on the prior channel and nothing will be received.
     */
    HAL_EXIT_CRITICAL_SECTION(s);

    macRxOff();

    DBG_PRINT1(DBGSYS, "MAC_RADIO_SET_CHANNEL(%u)", reqChannel);

    if (MAC_RADIO_SET_CHANNEL(reqChannel) == TRUE)
    {
      if(macRadioNeedAdjustPower(reqChannel, macPhyChannel))
      {
          macPhyChannel = reqChannel;
          macRadioSetTxPower(macPib.phyTransmitPower);
      }
      else
      {
          macPhyChannel = reqChannel;
      }
    }

    /* Request RX to be on */
    return macRxOnRequest();
  }

  HAL_EXIT_CRITICAL_SECTION(s);

