nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/ti_wisunfan/wisunfan_mac/low_level/cc13xx/mac_radio.c
  return TRUE;
}

MAC_INTERNAL_API bool macRadioUpdateChannelRx(void)
{
  halIntState_t  s;

  MAC_ASSERT(!(MAC_TX_IS_PHYSICALLY_ACTIVE()));
  /* if the channel has changed or a scanning is in process,
     set the radio to the new channel */
  HAL_ENTER_CRITICAL_SECTION(s);
  if ((reqChannel != macPhyChannel) ||
      (macRxEnableFlags & MAC_RX_SCAN))
  {
    /* Changing the channel stops any receive in progress.
     * Also note that this RX off and on sequence must be
     * executed for the coordinator since the radio may be
     * waiting for the prior RX on a different channel.
     * If the sequence is not executed, the radio will remain
     * stuck on the prior channel and nothing will be received.
     */
    HAL_EXIT_CRITICAL_SECTION(s);

    macRxOff();

    DBG_PRINT1(DBGSYS, "MAC_RADIO_SET_CHANNEL(%u)", reqChannel);

    if (MAC_RADIO_SET_CHANNEL(reqChannel) == TRUE)
    {
        if(macRadioNeedAdjustPower(reqChannel, macPhyChannel))
        {
            macPhyChannel = reqChannel;
            macRadioSetTxPower(macPib.phyTransmitPower);
        }
        else
        {
            macPhyChannel = reqChannel;
        }
    }
  }
  else
  {
    HAL_EXIT_CRITICAL_SECTION(s);
  }

  /* Request RX to be on */
  macRxOnRequest();

  return TRUE;
}

/**************************************************************************************************
 * @fn          macRadioStartScan
 *
 * @brief       Puts radio into selected scan mode.
 *
 * @param       scanMode - scan mode, see #defines in .h file
 *
 * @return      none
 **************************************************************************************************
 */
MAC_INTERNAL_API void macRadioStartScan(uint8 scanMode)
{
  MAC_ASSERT(macRxFilter == RX_FILTER_OFF); /* all filtering must be off to start scan */

  /* Save the current local PAN ID before any scan */
  macSavedPanID = pMacPib->panId;

  /* set the receive filter based on the selected scan mode */
  if (scanMode == MAC_SCAN_ED)
  {
    macRxFilter = RX_FILTER_ALL;
  }
  else if (scanMode == MAC_SCAN_ORPHAN)
  {
    /* if Energy detection ran before, then the radio is setup to do
     * CMD_IEEE_ED_SCAN. Setup radio to default of CMD_IEEE_RX instead.
     */
    macSetupReceiveCmd();
    macRxFilter = RX_FILTER_NON_COMMAND_FRAMES;
  }
  else
  {
    MAC_ASSERT((scanMode == MAC_SCAN_ACTIVE_ENHANCED) || (scanMode == MAC_SCAN_ACTIVE) ||
               (scanMode == MAC_SCAN_PASSIVE)); /* invalid scan type */

    macRxFilter = RX_FILTER_NON_BEACON_FRAMES;

    /* if Energy detection ran before, then the radio is setup to do
     * CMD_IEEE_ED_SCAN. Setup radio to default of CMD_IEEE_RX instead.
     */
    macSetupReceiveCmd();

    /* for active and passive scans, per spec the pan ID must be 0xFFFF */
    pMacPib->panId = 0xFFFF;
    MAC_RADIO_SET_PAN_ID(pMacPib->panId);
  }
}


/**************************************************************************************************
 * @fn          macRadioStopScan
 *
 * @brief       Takes radio out of scan mode.  Note can be called if
 *
 * @param       none
 *
 * @return      none
 **************************************************************************************************
 */
MAC_INTERNAL_API void macRadioStopScan(void)
{
  macRxFilter = RX_FILTER_OFF;

  /* restore the pan ID (passive and active scans set pan ID to 0xFFFF) */
  pMacPib->panId = macSavedPanID;
  MAC_RADIO_SET_PAN_ID(pMacPib->panId);
}


/**************************************************************************************************
 * @fn          macRadioEnergyDetectStop
 *
 * @brief       Called at completion of an energy detect.  Note: can be called even if energy
 *              detect is already stopped (needed by reset).
 *
 * @param       none
 *
 * @return      highest energy detect measurement
 **************************************************************************************************
 */
uint8 macRadioEnergyDetectStop(void)
{
  int8 rssiDbm;
  uint8 energyDetectMeasurement;

  rssiDbm = RF_getRssi(RF_handle);

  energyDetectMeasurement = radioComputeED(rssiDbm);

  DBG_PRINT1(DBGSYS, "ED: normalized energy level = %u", energyDetectMeasurement);

  return(energyDetectMeasurement);
}

/*=================================================================================================
 * @fn          radioComputeED
 *
 * @brief       Compute energy detect measurement.
 *
 * @param       rssi - raw RSSI value from radio hardware
 *
 * @return      energy detect measurement in the range of 0x00-0xFF
 *=================================================================================================
 */
uint8 radioComputeED(int8 rssiDbm)
{
  uint8 ed;
  int8 min, max;
  /*
   *  Keep RF power between minimum and maximum values.
   *  This min/max range is derived from datasheet and specification.
   */
  min = ED_RF_POWER_MIN_DBM;
  max = ED_RF_POWER_MAX_DBM;


  if (rssiDbm < min)
  {
    rssiDbm = min;
  }
  else if (rssiDbm > max)
  {
    rssiDbm = max;
  }

  /*
   *  Create energy detect measurement by normalizing and scaling RF power level.
   *
   *  Note : The division operation below is designed for maximum accuracy and
   *         best granularity.  This is done by grouping the math operations to
   *         compute the entire numerator before doing any division.
   */
  ed = (MAC_SPEC_ED_MAX * (rssiDbm - ED_RF_POWER_MIN_DBM)) / (ED_RF_POWER_MAX_DBM - ED_RF_POWER_MIN_DBM);
  return(ed);
}


/**************************************************************************************************
 * @fn          macRadioComputeLQI
 *
 * @brief       Compute link quality indication.
 *
 * @param       rssi - raw RSSI value from radio hardware
 *              corr - correlation value from radio hardware
 *
 * @return      link quality indicator value
 **************************************************************************************************
 */
MAC_INTERNAL_API uint8 macRadioComputeLQI(int8 rssiDbm, uint8 corr)
{
  (void) corr; /* suppress compiler warning of unused parameter */

  /*
   *  Note : Currently the LQI value is simply the energy detect measurement.
   *         A more accurate value could be derived by using the correlation
   *         value along with the RSSI value.
   */
  return(radioComputeED(rssiDbm));
}


/**************************************************************************************************
 * @fn          macRadioPowerDown
 *
 * @brief       Power down the radio by CM0 by sending an RF_yield command.
 *
 * @param       bypassRAT - Indicates if RAT disabling needs to be avoided
 *
 * @return      none
 **************************************************************************************************
 */
MAC_INTERNAL_API void macRadioPowerDown(bool bypassRAT)
{
}


/**************************************************************************************************
 * @fn          macRadioPowerUp
 *
 * @brief       Start the radio by sending a NOP command.
 *
 * @param       bypassRAT - Indicates if RAT restoration needs to be avoided
 *
 * @return      none
 **************************************************************************************************
 */
MAC_INTERNAL_API void macRadioPowerUp(bool bypassRAT)
{
}
